In [1]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [3]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

df[['age']] is the same as pd.DataFrame(df.age)â€©

In [5]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [7]:
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [11]:
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

# Only interested in name and age

In [12]:
# loc vs iloc
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [13]:
# select the first two rows (indices of rows)
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [15]:
# select the last two rows (indices of rows)
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [18]:
# : means all rows
# df.loc[:,['age', 'state']]
df[['age', 'state']]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [20]:
df.iloc[1]

name            mary
age               78
state             dc
num_children       2
num_pets           4
Name: 1, dtype: object

In [22]:
# people whose 'age' is greater than 30
df[df['age']>30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [23]:
df[df.age>30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [24]:
df[df["num_pets"] > df["num_children"]]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [36]:
#  AND
df[ (df.age>40) & (df.num_pets>0) ]
# df[ (df['age']>40) & (df['num_pets']>0) ]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [38]:
# OR
df[ (df.age>40) | (df.num_pets>0) ]
# df[ (df['age']>40) | (df['num_pets']>0) ]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

# Remove columns

In [42]:
# original df is untouched
df.drop(['age', 'num_children'], axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [43]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [46]:
# statistics about the data
# 25% means 25% of people are less than 22 year old
# 50% are less than 28
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

# What is the average for age, num_pets, and num_children?

In [47]:
import numpy as np
df[["age", "num_pets", "num_children"]].mean()
df[["age", "num_pets", "num_children"]].apply(lambda col: np.mean(col), axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

### What is the sum for age, num_pets, and num_children?

In [48]:
df[['age', 'num_pets', 'num_children']].apply(lambda col: np.sum(col), axis=0)

age             220
num_pets          9
num_children      8
dtype: int64

In [50]:
df.sum()
# states get concatenated

name                    johnmarypeterjeffbilllisa
age                                           220
state           iowadccaliforniatexaswashingtondc
num_children                                    8
num_pets                                        9
dtype: object

## Add all numerical values of age, num_pets, num_children

In [51]:
df[['age', 'num_pets', 'num_children']].apply(lambda row: np.sum(row), axis=1)

0    25
1    84
2    22
3    25
4    47
5    34
dtype: int64

## Select dataframe based on name

In [58]:
df[['age']]
# as pandas dataframe
# filtering columns

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [61]:
pd.DataFrame(df.age)
# as data frame

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [57]:
df['age']
# as list

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [59]:
df.age

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

### DataFrame methods always cater to the possibility that you have more than one column.

In [60]:
df[['age']].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

### you can manipulate the data frame by doing apply over either the series or the dataframe

In [62]:
df.sort_values('age', ascending=True)

    name  age       state  num_children  num_pets
3   jeff   19       texas             1         5
2  peter   22  california             0         0
0   john   23        iowa             2         0
5   lisa   33          dc             1         0
4   bill   45  washington             2         0
1   mary   78          dc             2         4

In [65]:
df[df.apply(lambda row: row['name'].startswith('j'), axis=1)]

   name  age  state  num_children  num_pets
0  john   23   iowa             2         0
3  jeff   19  texas             1         5

## RESHAPING DATA FRAME

In [66]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1â‚¬', '2â‚¬', '3â‚¬', '4â‚¬'])
))
d = DataFrame(table)

In [67]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1â‚¬
1  Item0  Bronze  2$  2â‚¬
2  Item1    Gold  3$  3â‚¬
3  Item1  Silver  4$  4â‚¬

## Pivot table from dataframe

In [69]:
p = d.pivot(index='Item', columns='CType', values='USD')

In [70]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$